[{"id":0,"title":"","message":""},{"id":1,"title":"january prayer showers","message":"<p>NEW YEAR\/PROPHETIC PRAYERS<\/p><p>1. God, I thank you for the privilege of seeing the year 2018.<\/p><p>2. Lord, may I long for you continuously throughout the year. Ps 42:1<\/p><p>3. Jesus the Alpha and Omega, as I have begun the year, may I finish strong and well.<\/p><p>4. Angel of the living God, go ahead of me into this year. Exo. 23:23a<\/p><p>5. In this year 2018, the Lord my God shall bless my bread and my water. Exo. 23:25a<\/p><p>6. The Lord shall take away sickness from me and my family in this year 2018. Exo. 23:25b<\/p><p>7. This year, there will be no miscarriages or infertility in all areas of my life in Jesus name. Exo. 23:26a<\/p><p>8. The Lord shall perfect all that concerns me and my family this year in the name of Jesus. Ps. 138:8<\/p><p>9. Every place that the soul of my foot shall tread upon this New Year, the Lord shall give unto me in the name of Jesus. Jos. 1:3<\/p><p>10. No one shall be able to stand before me every day of this year 2018 in Jesus' name. Jos.1:5<\/p><p>11. This year, the Lord will do great wonders in my life and family in the name of Jesus. Jos. 3:5<\/p><p>12. O Lord, let all my wasted years and efforts be converted to multiple blessings in Jesus name. Gen. 41:51<\/p><p>13. I shall not die but live and declare the works of the Lord in Jesus' name. Ps 118:17<\/p><p>14. I receive fresh grace to follow and obey the Lord in this year 2018. Num 14:24<\/p><p>15. Every day of this year, I and my family shall find favor in the eyes of God and Man. Luke 2:52<\/p><p>16. Lord, let your face shine on me. Ps 4:6b<\/p><p>17. Every day of this year, I will lie down and sleep in peace, the Lord will make me dwell in safety. Ps 4:8b<\/p><p>18. I shall be called by a new name (experience new things in all areas of life) in the name of Jesus. Gen 35:10<\/p><p>19. O Lord, be with me and let everything I do this year prosper in the name of Jesus. Gen 39:23b<\/p><p>20. God shall give me an answer of peace, concerning all my request this year in the name of Jesus. Gen 41:16b<\/p><p>21. This year, my long awaited dreams shall be fulfilled in the name of Jesus. Gen 41:41-43; 42:6b<\/p><p>22. The Lord shall make me fruitful in all my endeavours this year. Gen 41:52<\/p><p>23. I receive DIVINE ABILITY to drive out the evil occupants of my divine inheritance in the name of Jesus. Judges 1:19a<\/p><p>24. The Lord will do a new thing in my life and my family this year in the name of Jesus. Isaiah 43:19a<\/p><p>25. The Lord shall expose every evil planned against my life and grant me victory over them in Jesus' name. Ps 18:28b<\/p><p>26. This year, the Lord will bring light into every dark areas of my life in the name of Jesus. Isaiah 42:16b<\/p><p>27. Every good thing in my life that has become crooked shall be made straight in the name of Jesus. Isaiah 42:16<\/p><p>28. The Lord will lead and guide me along every unfamiliar way I need to pass through this year. Isaiah 42:16<\/p><p>29. Whenever the enemy shall come in like a flood against my life and family, the SPIRIT of the LORD shall lift up a standard against him in the name of Jesus. Isaiah 59:19b<\/p><p>30. In this year 2018, every valley of my life shall be exalted and every hill shall be made plain. Isaiah 40:4.<\/p><p>ANIOMA CONFERENCE<\/p><p>1. Pray that God will grant the Conference divine speed for more physical and spiritual development in the year 2018.<\/p><p>2. Pray that God will use the 4th Annual Evangelism Summit of the Conference to raise more passionate hearts that will be committed to winning souls for the kingdom of God.<\/p><p>3. Pray for God's gracious move and success for all Conference activities in the year.<\/p><p>4. Ask God for great vision and provision of resources for church planting to strenghten the Baptist work in the conference as well as cover new grounds.<\/p><p>5. Ask God to grant the Conference progressive ideas to inspire and grow all the churches in the Conference during the Church Growth Summit that will hold in Asaba in the year.<\/p><p>6. Pray for all churches experiencing very slow growth that God will grant them divine acceleration and spiritual reawakening which will bring glory to Him.<\/p><p>7. Ask God to strengthen the pastors and ministers in the core rural areas of the Conference for courage to persevere and build viable churches within their difficult terrains.<\/p><p>8. Ask God to break the wings of darkness and all such spiritual forces that are capable of slowing down the pace of growth in Baptist churches.<\/p><p>9. Pray for the mighty hand of grace upon Pastors in the Conference as they minister during the simultaneous stewardship revival across churches. Let God raise willing hands in all churches.<\/p><p>10. Give God praise for His sustaining grace upon Anioma Baptist Conference and His faithfulness over developments in the conference so far.<\/p><p>BAYELSA CONFERENCE<\/p><p>1. Thank God for the 10th anniversary of the Conference that holds this year 2018.<\/p><p>2. Thank God that the Word will prevail in the creeks of Bayelsa. Pray that the Word of God will reach more people.<\/p><p>3. Thank God for the support that the conference has received from churches in the area of church planting and pray for grace to plant more churches.<\/p><p>4. Pray that God will expand the financial base of the conference to enable them do more in rural evangelism.<\/p><p>5. Ask that the Lord will cause the Word to have dominion in every area of Bayelsa.<\/p><p>6. Pray for more dedicated members in the Conference to answer the call into gospel ministry.<\/p><p>7. Pray for a better economic environment and financial empowerment of members in the Conference.<\/p><p>8. Pray that the Lord will disarm the spirit of militancy in Bayelsa state.<\/p><p>9. Pray that the Lord will raise dedicated, selfless and committed leadership in the Conference.<\/p><p>10. Pray that God will baptise members of the Conference with His glorious presence.<\/p>"},{"id":2,"title":"february prayer showers","message":"<p>SPIRITUAL DEVELOPMENT AND GROWTH<\/p><p>1. Lord Jesus, help me to have a growing desire for Your Word this year that I may grow and become a better Christian.1 Peter2:2.<\/p><p>2. Lord Jesus, help me to discard every pride and arrogance that will prevent me from growing spiritually. 1 Peter2:2.<\/p><p>3. My Father, I receive the grace to be diligent, faithful and morally inclined as I grow in your knowledge. 2 Peter1:5<\/p><p>4. Lord Jesus, I release my life as a fertile ground to manifest Your glory.<\/p><p>5. Father, let Your endowments upon me lead to the increase in the harvest of your righteousness in my life.<\/p><p>6. Lord Jesus, give me the grace to grow in faith in all spiritual endeavours. Ephesians 4:15.<\/p><p>7. My Father my Father, help me to walk worthy of You, pleasing you in all respects and bearing fruit in every good work in Jesus' name. Colossians1:10.<\/p><p>8. Dear Lord, grant me the enablement to increase in Your knowledge in Jesus' name. Colossians1:10.<\/p><p>9. Father, I need Your help to increase and abound in love towards other people in order to fulfil Your mandate on earth in Jesus' name. 1 Thessalonians 3:12.<\/p><p>10. Lord, grant me greater desire to not only grow spiritually but to live an exemplarylife.1 Thessalonians 4:10.<\/p><p>11. O Lord, I receive your grace to move on to maturity in Christ this year. Hebrews 6:1<\/p><p>12. My Father and my Lord, as I grow in Your knowledge, increase my ability for self-control, perseverance and godliness in Jesus' name.2 Peter 1:6.<\/p><p>13. Lord God, help me to grow in the grace and knowledge of our Lord and Saviour Jesus Christ.2 Peter3:18.<\/p><p>14. My Father my Father, anoint me to grow in stature and in favour both with the LORD and with men, in the name of Jesus.1 Samuel2:26.<\/p><p>15. Father, help me to grow to become strong in spirit and to withstand all challenges of life without denying the faith even in death. Luke 1:80.<\/p><p>16. Lord Jesus, as I continue to grow in You to become strong in faith, increase me in Your wisdom with gracious manifestation. Luke 2:40.<\/p><p>17. O Lord, may I always grow from strength to strength in propagating the gospel wherever You lead, in Jesus' name. Acts 9:22.<\/p><p>18. My Father my Father, I ask you for an enlarged faith and greater expression of the love of God, in Jesus' name.2 Thessalonians1:13.<\/p><p>19. Father, I desire that Your Word richly dwell within me with all wisdom, teaching and mutual admonition with praise and a thankful heart, in Jesus' name. Colossians3:16.<\/p><p>20. Lord Almighty, I receive the strength and grace to withstand the challenges of spiritual growth so that my progress will be evident to all in due time. Ephesians4:15.<\/p><p>CENTRAL CONFERENCE<\/p><p>1. Pray for the new Conference president, Rev. Dr Sale Koleh and his associates for God to see them through in their leadership position.<\/p><p>2. Pray that God will help members of the Conference to be known more by love for God and others rather than by church affiliation.<\/p><p>3. Pray for the spirit of cooperation to continue to wax stronger in the conference.<\/p><p>4. Pray that the leadership of the Conference will be endowed with the spirit of sacrificial service.<\/p><p>5. Pray for divine provision for the actualisation of the ultramodern youth secretariat complex that is under construction.<\/p><p>6. Pray for God's intervention in the life of the youths and favour to get good job.<\/p><p>7. Pray for students at all levels to finish with good grades.<\/p><p>8. Pray that the Lord will establish new and godly homes among the youth.<\/p><p>9. Pray for unity among members of the Conference.<\/p><p>10. Pray for pastors in the Conference to be faithful in discharging their duties and to diligently study God's word as preachers.<\/p><p>EDO CONFERENCE<\/p><p>1. Join Edo Conference to sing praises and give thanks to Abba Father for His faithfulness in the Conference all through the year 2017. Psalm 104: 33.<\/p><p>2. Pray and nullify any plan to derail the Conference through witchcraft and court cases or evil bloggers in 2018. Job 22:28.<\/p><p>3. Pray that all that the locust has eaten, the cankerworm and the caterpillar and the palmer worm be restored to the Conference this year. Joel 2:25.<\/p><p>4. Pray that God’s thought of peace towards the Conference will come to pass this year. Jeremiah 29:11.<\/p><p>5. Prophesy according to God's Word that doors of miracles, wonders, breakthroughs, testimonies and expansion are open in the Conference this year in Jesus Name.1 Corinthians 16:9.<\/p><p>6. Pray that the Lord will make members to be true and worthy ambassadors of the Conference both in word and in deed in Jesus' name. Jeremiah 33:3.<\/p><p>7. Pray against adversaries of the Conference by way of betrayal, blackmail, falsehood, accusations and confusion. Pray that they be crippled and paralyzed in Jesus' name. Romans 1:16<\/p><p>8. Pray that the Lord will strengthen members to grow and fulfil reconciliation in the Conference in Jesus’ name.2 Corinthians 5:18.<\/p><p>9. Pray that Abba Father will release all that is needed to grow the Conference to her place of fulfilment in Jesus' name. 2Timothy 4:5.<\/p><p>10. Decree and declare that the Conference shall henceforth enjoy unusual growth: spiritually, materially, numerically, financially, physically etc. Job 22:28.<\/p><br>"},{"id":3,"title":"march prayer showers","message":"<p>PRAYER FOR PROGRESS AND GREATNESS<\/p><p>1. Thank you Lord, because You alone have the power to move my life forward. 1Sam 2:9c.<\/p><p>2. Lord, raise me up from every satanic dust and set me with the princes of Your people. Ps 113:7,8; 1Sam 2:8.<\/p><p>3. Lord, release upon my life the oil of greatness. Ps 92:10b.<\/p><p>4. Lord, increase my spiritual and physical greatness. Ps 71:21a.<\/p><p>5. O God arise and show me a token for greatness. Ps 86:17.<\/p><p>6. Lord, reveal to me that which will make me great. 1Sam 17:26; 18:7.<\/p><p>7. I receive divine power to prevail against anything that hinders my progress. 1Sam 17:39c, 50.<\/p><p>8. Whoever is plotting evil scheme against my greatness, and progress, be cursed by the LORD. 1Sam 26:19.<\/p><p>9. Lord, catapult me into greatness as you did for Daniel in the land of Babylon. Daniel 2:48.<\/p><p>10. Let everything preventing my progress and greatness bow in Jesus' name. Phillipians 2:10.<\/p><p>11. Let there be turbulence and re-arrangement of situations in order to create a path to my desired greatness in Jesus' name. Gen. 11:8.<\/p><p>12. Lord, send men and women who will help me get to that position of greatness meant for me. 1Chronicles 12:22-23.<\/p><p>13. The Lord who changed the lot of Jabez, visit me in the name of Jesus. 1Chronicles 4:9-10.<\/p><p>14. Lord, move my status from minimum to maximum. 1Chronicles 4:9-10.<\/p><p>15. The Lord that made the life of Obed-Edom experience geometric progress and greatness, visit me in the name of Jesus. 1Chronicles 13:14.<\/p><p>16. Let there be divine occurrence that will give room for the manifestation of my greatness. 1Chronicles 13:10-14.<\/p><p>17. Lord, let the fame of my progress and greatness spread everywhere to the glory of God. 1Chronicles 14:17a.<\/p><p>18. Lord, bless me greatly and help me become great. Gen 24:35a.<\/p><p>19. Lord, give me divine guidance, take me to the place where Your blessing of greatness will locate me in the name of Jesus. Gen. 26:2-3<\/p><p>20. At a time when people say things are difficult; let me reap a hundredfold profit from my labour. Gen. 26:12.<\/p><p>21. Lord, bless the work of my hand, so that I will experience progress and greatness. Gen. 26:13.<\/p><p>22. LORD, let my enemies envy Your blessing of greatness in my life. Gen 26:14c.<\/p><p>23. LORD, make room for me to be fruitful even in the face of opposition. Gen 26:22.<\/p><p>24. LORD, make my life experience progress in such a way that people around me will confess that my God is mighty. Gen 26:16c.<\/p><p>25. LORD, let my oppressor see your hand in my life and declare that “I am more and mightier than they are”. Exodus 1:9.<\/p><p>26. Lord, cause the adversaries of my progress to be broken to pieces in Jesus’ name. 1Sam 2:10a.<\/p><p>27. Lord, exalt the horn of my divine destiny in the name of Jesus. 1Sam 2:10c; Ps 92:10.<\/p><p>28. I disband all evil hosts gathered against my progress in the name of Jesus. Exo 14:24c.<\/p><p>29. Lord, let the power of the Holy Spirit that activates progress and greatness manifest in my life. Exo 8:18-19.<\/p><p>30. O Lord, quicken Your Word to perform it this month in my life. Jeremiah 1:12.<\/p><p>EKITI CONFERENCE<\/p><p>1. Lord, let there be great revival in Ekiti Conference this year and restore Your people to Yourself. Lamentation 5:21.<\/p><p>2. Lord, touch the heart of members and circumcise them for oneness of purpose to fulfil Your will.<\/p><p>3. Lord Jesus, inspire all the leaders in the Conference and release fresh anointing upon them to carry out Your purpose and glorify Your name.<\/p><p>4. Father Lord, send Your fire and consume the spirit of poverty in the Conference in Jesus' name. Open members’ spiritual eyes to see and tap heaven's resources around them.<\/p><p>5. Lord Jesus, create a come-home spirit in the heart of all successful Ekiti indigenes across the globe to come and assist in building a viable ministry for Your glory in the Conference.<\/p><p>6. God, let there be great re-awakening among youths in the Conference and let the light of the gospel shine upon their hearts. Grant them breakthrough to succeed in their life endeavours.<\/p><p>7. Ask that the Lord will create a willing heart for church planting andevangelism among churches in the Conference.<\/p><p>8. Pray that the Lord will release divine enablement among all the organs of the Conference to fulfil mission mandate. Grant the organs a willing heart to do Your will.<\/p><p>9. Lord Jesus, let your peace reign as Ekiti people go to the polls this year to elect another governor. Pray that the anointed candidate that will take Ekiti State to her promise land shall emerge in Jesus' name.<\/p><p>10. Lord Jesus, give Ekiti Conference Your peace, joy, prosperity and breakthrough in all their endeavours this year. Help them to be salt and light to the world around them as they carry out their divine assignment to the glory of Your name this year.<\/p><p>ETHIOPE DELTA CONFERENCE<\/p><p>1. Appreciate God for the creation of the Conference and for how far He has led the Conference in fulfilling the mission mandate.<\/p><p>2. Pray for divine intervention in overcoming besetting challenges facing the Conference.<\/p><p>3. Pray that God will raise up ministry supporters that will enable the Conference berth their dreams and visions.<\/p><p>4. Pray that God will create in the leadership of churches in the Conference the hunger and yearnings to be truly faithful in all ramification; especially the cooperative program.<\/p><p>5. Pray for the spirit of cooperation and unity amongst their church workers so as to enable them maximise their potentials for the overall growth of the churches.<\/p><p>6. Pray that God's people will not loose sight of the imperativeness of the great commission by concentrating their efforts on building structures at the expense of building lives.<\/p><p>7. Pray that the zeal for aggressive evangelism will not die in the Conference.<\/p><p>8. Pray for divine wisdom as the Conference grapple with the challenge of leadership.<\/p><p>9. Pray for divine provision of needed resources that will enable the Conference address the twin issues of church-less Pastors and Pastor-less churches.<\/p><p>10. Pray for grace for the Conference president to finish strong in the calling to ministry leadership.<\/p>"},{"id":4,"title":"april prayer showers","message":"<p>COMMITMENT TO SERVICE AND MINISTRY<\/p><p>1. O Lord, I receive grace to serve You in sincerity and truth, in Jesus' name. Joshua 24:14.<\/p><p>2. O Lord, I receive grace to be totally committed to Your work in obedience to Your commandments and statutes, in Jesus' name. Deuteronomy 27:10.<\/p><p>3. Father Lord, I submit my heart wholly to You, to walk worthy in the ministry You have committed into my hands in Jesus' name.1 Kings 8:61.<\/p><p>4. My Father, my Father I commit my ways into your hands, yielding to Yours in all that I do. Ps.37:5.<\/p><p>5. Lord Jesus, I will deny myself of worldly pleasures, take up my cross and follow you daily. Luke 9:23.<\/p><p>6. O Lord, by Your enabling grace I will not allow mundane issues interfere with my commitment to your service, in Jesus' name. Luke 14:26-27.<\/p><p>7. My Father, I am wholly sold out to You and Your service in 2018 and beyond. Galatians 2:20.<\/p><p>8. O Lord, by the love of Jesus and His selfless sacrifice for me, I am totally committed to Your work. I live by faith in Jesus Christ so I can fulfill ministry here on earth. Galatians 2: 20.<\/p><p>9. O Lord, I receive Your grace to resist being conformed to the patterns of this world, but to be transformed by the renewing of my mind so as to excel in your service and ministry, in Jesus' name. Romans 12: 2.<\/p><p>10. Lord Jesus, give me the grace to be continually committed to Biblical injuctions in Jesus' name. Acts 2:42.<\/p><p>FELLOWSHIP CONFERENCE<\/p><p>1. Pray for all the Baptist families in Fellowship Conference who were seriousl affected by the Boko Haram attack of 2014. They are still recovering from the trauma of the attacks.<\/p><p>2. Pray for divine provision to build a new Conference secretariat.(The Conference office that was destroyed by fire is yet to be rebuilt).<\/p><p>3. Pray that God will touch the hearts of mission-minded people and churches all over the world to assist the Conference with the funds needed to rebuild church buildings that were destroyed.(The destroyed churches\/conference office are yet to receive any financial assistance from government or non governmental organizations).<\/p><p>4. Pray that the Lord will comfort families of some members who lost their beloved ones during the Boko Haram attacks.<\/p><p>5. Pray for some communities in the Conference that are still in the grip Boko Haram insurgents e. g Madagali, Gwoza, Bama and the suburbs of Maiduguri metropolis. Members in these communities are still internally displaced.<\/p><p>6. Pray for staff and students of Baptist High School Mubi. Ask that God would provide the finances needed for the smooth running of the school.<\/p><p>7. Pray for the missionaries\/mission pastors working in the Conference mission fields at Dumne and Michika that God should provide for their needs and the needs of the mission fields.<\/p><p>8. Thank God for the life of Deaconess Felicia Abims who was abducted by Boko Haram insurgents in 2014 but miraculously escaped from their enclave in August 2016 without denying her faith in Jesus Christ. Pray that God will heal her of the psychological trauma of being in their custody.<\/p><p>9. Pray for the Conference vision of planting more churches through her local churches to counter the plan of the Islamic agenda. Pray that the Conference efforts will not be thwarted.<\/p><p>10. Pray for all church pastors and their families in Fellowship Conference that God will give them the grace to work with confidence in spite of the security challenges in the Conference.<\/p><p>HOPE CONFERENCE<\/p><p>1. Thank God for all He has done for Hope Conference. May His grace continue to be sufficient for the Conference in every area of human endeavour.<\/p><p>2. Pray that sin shall not have dominion over every member of the Conference this year.<\/p><p>3. Pray for grace to correct every wrong foundation responsible for stagnation and retrogression in the Conference.<\/p><p>4. Pray for peace to reign in Cross River and Akwa Ibom states; bind every spirit of cultism; and pray that members of the Conference will not be kidnapped or killed.<\/p><p>5. Let the covenant of long life, good health and prosperity be activated in the lives of members this year. Members will not die young nor bury their young ones.<\/p><p>6. Pray for members to receive grace to live in obedience, pleasing God in all their ways.<\/p><p>7. Bind every strong man, satanic agents and the gate of hell resisting the planting and growth of churches in the conference. Let grace be released to plant more churches and stagnant ones revived.<\/p><p>8. Pray that God will bless expectant singles with their partners, expectant couples with children.<\/p><p>9. Pray that student will excel academically; those in business will prosper greatly; and accelerated promotion for all public and civil servants.<\/p><p>10. Pray for the enlargement of the Conference's spiritual, financial, material and ministerial capacities, that they may be able to accomplish more to break new grounds.<\/p>"},{"id":5,"title":"may prayer showers","message":"<p>PRAYERS FOR CHILDREN<\/p><p>1. Father, I thank You for my children, and I pray that my children shall know Your Will and walk in it. (Proverbs 3:5, 6)<\/p><p>2. I pronounce into the life of my children that the Lord shall bless you; His face will shine on you, be gracious to you, and give you peace. (Numbers 6:24-26)<\/p><p>3. I pray that every enchantment and divination against my children will not come to pass. (Numbers 23:23)<\/p><p>4. Father, bestow on my children the spirit of excellence and wisdom. (Daniel 6:3)<\/p><p>5. God, I commit my children to Your care and watch. (Psalm 91:1)<\/p><p>6. I prophesy in line with God's Word, my children shall be the head and not the tail; they will not serve their mates. (Deut 28: 13)<\/p><p>7. Lord, do not allow my children to align themselves with association that will hinder them from knowing You, and destroy their lives. (1 Corinthians 15:33)<\/p><p>8. I stand on the word of God, and I pronounce that darkness will not overshadow my children; the light of God will shine on their ways. (John 1:5)<\/p><p>9. Father, I pray that the spirit of worldliness will not control my family (James 4:4)<\/p><p>10. I use Psalm 18:44, 45 to pray for my children and declare that strange spirits will not gain entrance into the life of my children in the mighty name of Jesus.<\/p><p>11. Father, when it is time for my children to have homes; give them stable home, and make them fruitful. (Exodus 2: 21)<\/p><p>12. Lord, give my children spirit of contentment; may the spirit of arrogance not possess them. (2 Timothy 4:18)<\/p><p>13. In line with word of God, my children shall possess the gate of their enemy,<\/p><p>and be mighty in the land. (Genesis 22:17)<\/p><p>14. It is written that good success shall be the portion of my children, and failure will not be their portion. (Joshua 1:7)<\/p><p>15. Father, do not allow my children to do anything that bring disrepute to the name of the Lord. (1 Corinthians 10:33)<\/p><p>16. I cancel generational spell over my children in Jesus' Name. (1John 1:7)<\/p><p>17. Father, according to your word in 3 John 2, my children shall have sound health.<\/p><p>18. I pronounce into the life of my children that they will experience open doors all the days of their live in Jesus name. (Revelations 3:8)<\/p><p>19. Lord, raise a standard against opposition to breakthrough of my children. (Isaiah 59:19)<\/p><p>20. Father, let your honour be upon my children all days of their lives. (1 Samuel 9:6)<\/p><p>21. I declare prophetically that my children will be great and experience multiplication. (Genesis 12: 2, 3)<\/p><p>22. My earnest prayer is that my children will be a blessing to their generation and change the world through the gospel. (Acts 17:6)<\/p><p>23. I break into pieces every monitoring device that the devil is using to monitor the glory of my children. (Isaiah 54:17)<\/p><p>24. Father, close every door the enemy is using to cause chaos and confusion in the life of my children. (Matthew 15:13)<\/p><p>25. I declare prophetically that the purpose of God for my children will be established. (Jeremiah 29:11)<\/p><p>IBADAN CONFERENCE<\/p><p>1. Thank God for five years of the Conference’s existence.<\/p><p>2. Pray for God's grace for the supporting associations and churches to remit their Conference dues promptly.<\/p><p>3. Pray for God's protection over every conference worker as they travel leading seminars, retreats and workshops.<\/p><p>4. Pray for revelation for pastors to lead churches in the Conference in the way of the Lord.<\/p><p>5. Pray for provision towards completing the capital projects of the Conference.<\/p><p>6. Ask that God will give grace to the missionaries in the Conference mission fields and mission churches; pray for the harvest of souls in various mission outreaches.<\/p><p>7. Pray for strengths, wisdom and vision for the conference leadership to actualise their goals.<\/p><p>8. Pray that members of the Conference will be committed, discipled and disciplined.<\/p><p>9. Pray for breakthroughs and peace for churches within the Conference passing through challenging moments.<\/p><p>10. Pray for all missionary organizations, fellowships and departments in the Conference to fulfil their God-given mandates.<\/p><p>KADUNA CONFERENCE<\/p><p>1. Thank the Almighty God for 40 years of the Conference’s existence. Pray for greater harvest for God's Kingdom.<\/p><p>2. Pray that the new vision of the Conference for ministry will glorify God and will not be hindered by any force.<\/p><p>3. Pray for greater understanding, commitment and unity among churches in the Conference.<\/p><p>4. Pray for increased funding, equipment and personnel for mission endeavours of the Conference.<\/p><p>5. Pray that pastors will always remember they are bearers of God's Holy Name and keep the banner of righteousness raised at all times.<\/p><p>6. Pray that the messages and teachings from the pulpits will be \"the whole counsel of God\".<\/p><p>7. Pray that God will give pastors and members the Spirit of wisdom and revelation, so that they may know Him better.<\/p><p>8. Pray for successful transition of leadership. Ask for wisdom and grace for the new Conference President to excel beyond his predecessors.<\/p><p>9. Pray that God will pour his manifold blessings on pastors, members and churches in the Conference.<\/p><p>10. Pray that the relaying of the foundation of the new Conference\/Convention pavilion will be successful and finished in record time.<\/p>"},{"id":6,"title":"june prayer showers","message":"<p>PRAYERS FOR CAREER\/BUSINESS PURSUIT<\/p><p>1. Father, take my career out of dry land, and make it fruitful and blossom. (Genesis 26:22)<\/p><p>2. God of miracles, open the floodgate of blessings over my business pursuit. (Malachi 2:10)<\/p><p>3. According to your word, I rebuke devourers, and cankerworms eating business in Jesus’ name. (Joel 2:25)<\/p><p>4. Lord, endow me with the required mental skill to turn every opportunity that comes my way into blessings. (Isaiah 11:1,2)<\/p><p>5. Father, take away struggle and loss from my career; I decree I will lend to nations. (Deuteronomy 28: 12)<\/p><p>6. Lord, send helpers, providers and lifters that will take my business to next level. (1Samuel 9:1-5)<\/p><p>7. Holy Spirit, expose agents of destruction among my employees that areplanning the downfall of my business. (2 Corinthians 10:2-5)<\/p><p>8. Father, baptize my employees with the spirit of commitment, loyalty and faithfulness that will increase the productivity of my business. (Genesis 39:2-5)<\/p><p>9. I speak with authority and pray for a miraculous recovery of all debts owed my business in the mighty name of Jesus. (1Samuel 30: 8)<\/p><p>10. I pray that my business premises will not bewitch the growth and expansion of my business. (Joshua 1:3)<\/p><p>11. Lord, I cry unto you that the economy policy of the nation will favour the growth and expansion of my business. (Romans 8:28)<\/p><p>12. Lord, in your power, I resist being teleguided or manipulated by fraudsters that want to cart away blessings in business\/career in the mighty name of Jesus. (1Peter 5:9)<\/p><p>13. Lord, I reject the spirit of impossibility in my business, and I claim open doors in Jesus name. (Revelations 2:8)<\/p><p>14. Father, in line with Your Word, I declare that every ancient gates and doors over my business be lifted. (Psalm 24: 7-10)<\/p><p>15. Lord, I command every strange hand upon my business\/career to wither in Jesus name. (1 Kings 13: 4)<\/p><p>16. Lord, I receive a clear direction and guidance that will lead to breakthrough for my business. (Psalm 32:8)<\/p><p>17. Lord, I roll away the “reproach of Egypt” from my business. (Joshua 5:9)<\/p><p>18. I declare that the favour of God will be on any business transaction I make in the mighty name of Jesus. (Psalm 5:12)<\/p><p>19. I pronounce with authority in Christ name that my business will soar above my adversaries in total victory in Jesus name. (2 Corinthians 2: 14)<\/p><p>20. I declare in line with the word of God that my business\/career will flourish, blossom, and prosper beyond the expectations of man in Jesus Name. (Jeremiah 29:11)<\/p><p>KOGI CONFERENCE<\/p><p>1. Pray for spiritual growth for members of all the Baptist churches in the Conference.<\/p><p>2. Pray that churches will be faithful in the Convention Cooperative Programme, and for members to be faithful in tithing.<\/p><p>3. Pray that God will lead the Conference through the search committee to choose a new conference president.<\/p><p>4. Pray for mission consciousness among the churches so that the Conference may double the present number of churches (135) within the next three years.<\/p><p>5. Ask that God will open doors of financial prosperity for the Conference.<\/p><p>6. Pray that Kogi State Government will pay all outstanding salary and pension arrears to civil servants in the state.<\/p><p>7. Pray for protection and deliverance from all the works of darkness for members in the Conference.<\/p><p>8. Pray for grace to complete all projects of the Conference including the provision of a car for the conference’s use.<\/p><p>9. Pray that God will take away every spirit of carnality in the life of members and pastors in the Conference.<\/p><p>10. Pray that pastors will grow in Spirit and knowledge of God; that the Holy Spirit will enable them to lead their churches in the right way through their preaching and Bible studies.<\/p><p>KWARA CONFERENCE<\/p><p>1. Pray for Kwara Conference as she clocks 50 this year. Pray for God's grace and mercy. Pray for the 50th Anniversary celebration to hold in August 2018.<\/p><p>2. Pray for God's provision and open doors for the completion of conference's worship centre.<\/p><p>3. Pray for the Conference's Academy. Pray for the students, teachers, and nonteaching staff for wisdom, knowledge and strength.<\/p><p>4. Pray for Batonu Mission Field; pray for the Hospital and Guest House in Okuta; pray for the staff.<\/p><p>5. Pray for the Guffanti mission field; pray for our pastors and their families as they spread the gospel in Guffanti Mission Field.<\/p><p>6. Pray for members of the Executive Committee of the Conference for wisdom, knowledge and understanding to direct the affairs of the Conference.<\/p><p>7. Pray for God's protection, provision and providence for all pastors, deacons, deaconess and churches in the Conference.<\/p><p>8. Pray for provision to complete the on-going project to celebrate the 50th Anniversary of the Conference (5 Chalets for 50th Anniversary).<\/p><p>9. Pray for the moderators and the twelve associations in the Conference.<\/p><p>10. Pray for Rev. Dr and Mrs V. S. A. Dada's family (Conference President) for God's protection, provision and providence.<\/p>"},{"id":7,"title":"july prayer showers","message":"<p>WARFARE PRAYERS<\/p><p>1. Lord, according to Your Word in Haggai 2:9b, give me peace in my place of abode.<\/p><p>2. Lord stir up the heart of my helpers to help me. Haggai 1:14<\/p><p>3. Let no man trouble me from now on, for I bear in my body, the marks of the Lord Jesus. Galatians 6:17<\/p><p>4. Lord separate my life from every battle associated with my foundation.<\/p><p>5. Lord help me not to fall out of my place of divine location. Genesis 3:23-24<\/p><p>6. Help me Lord to always do what is right so I can be acceptable in your sight. Genesis 4:17<\/p><p>7. O God my Father, give me grace to work in close fellowship with you all the days of my life. Genesis 5:24<\/p><p>8. Lord God, give me the heart that obeys completely. Genesis 6:22; 7:5<\/p><p>9. O Lord, remember me for good as you did concerning our covenant fathers in the Bible. Genesis 8:1<\/p><p>10. Lord help me to offer sacrifice of praise, prayer, money e.t.c. that provoke divine blessings upon my life and generation. Genesis 8:21-22<\/p><p>11. O God of heaven and earth, expand my territory in the name of Jesus. Genesis 9:27<\/p><p>12. O Lord confuse the language of satanic agents assigned to frustrate me. Genesis 11:7<\/p><p>13. Lord, put a stop to every evil project proposed against my life. Genesis 11:8<\/p><p>14. Let your presence overshadow me, and make me succeed in all I do. Genesis 39:2<\/p><p>15. Lord, make everything I lay my hands on prosper. Genesis 39:3b<\/p><p>16. Lord, show me mercy and give me favour in the sight of my destiny helper. Genesis 39:21<\/p><p>17. O Lord let the time and season of my divine manifestation come this month. Genesis 41:1a<\/p><p>18. God of heaven and earth put in my hands the gift that will elevate my calling. Genesis 41:14.<\/p><p>19. Lord, give me a miracle that will make me forget all the troubles of my past life. Genesis 41:51<\/p><p>20. O God arise in your justice, recompense tribulation to all those who trouble me. 2 Thessalonians 1:6<\/p><p>LAGOS CENTRAL CONFERENCE<\/p><p>1. Pray that members of the Conference will remain kingdom people and take the Great Commission as kingdom project towards saving souls and growing churches.<\/p><p>2. Pray for Apapa Association churches and members to receive God's power and provision for advancement.<\/p><p>3. Pray for Badagry Redemption Association churches and members; for salvation of EGUN and AWORI people group; and completion of personal and church projects.<\/p><p>4. Pray for J.T. Ayorinde Association churches and members for restoration of glory for each church and blessings upon each member.<\/p><p>5. Pray for New Creature Association churches and members for divine assistance and evangelistic advancement.<\/p><p>6. Pray for New Heights Association churches and members to go to new levels of spiritual and structural developments in breaking news frontiers.<\/p><p>7. Pray for New Life Association churches and members for fresh revelations and needed spiritual and financial strengths to take territories for God.<\/p><p>8. Pray for Shalom Association churches and members for continuous financial supplies to keep breaking new grounds and be protected always.<\/p><p>9. Pray for United Association churches and members for power for accomplishment and financial breakthroughs for her membership.<\/p><p>10. Pray for Unity Association churches and members for unity of purpose for advancement in spiritual and structural developments.<\/p><p>11. Pray for Christian Education, Missions efforts and Missionary Organizations (MMU, WMU and YOUTH) with all their organs to remain focused on missions and committed to kingdom projects.<\/p><p>12. Pray for the pastors and deacons of the Conference for the spirit of cooperation and commitment to the growth of churches through salvation, discipleship and equipping of the saints for the work of the ministry.<\/p><p>LAGOS EAST CONFERENCE<\/p><p>1. Thank God, for His faithfulness in the life of the Conference since inception. Pray that the Lord will continue to make the Conference relevant in the proclamation of kingdom message.<\/p><p>2. Father, let every power hindering Lagos East Baptist family and churches from proclaiming gospel message in a productive way be rendered useless; empower member churches to reach the unreached.<\/p><p>3. Lord, make all pastors, deacons and worship leaders instrument of transformation, and grant them special insight on how to engage in kingdom business.<\/p><p>4. Father, according to Isaiah 40:29, let your awesome power and strength for self-control fall and rest upon kingdom workers of the Conference this year.<\/p><p>5. Lord, open the spiritual eyes and ears of those that will attend Conference seminars and programmes this year to understand the secrets of the kingdom of heaven and apply them for the growth of the church.<\/p><p>6. Lord, give all Conference social ministry workers strength to serve you faithfully as they reach out to prison inmates, orphanage and the aged this year and help them to empower others to love and serve you too.<\/p><p>7. Dear Lord Jesus, give every member of Lagos East the boldness that comes through the indwelling of the Holy Spirit to witness to the lost souls and to remain faithful to the end.<\/p><p>8. Heavenly Father, I pray that all Conference departmental heads shall live and walk in holiness and in righteousness in their quest to impact lives and lead others on the Lord's highway.<\/p><p>9. Lord Jesus Christ, I pray for Baptist Students that none of them will be victim of cult practices in their schools and institutions. Help these students to dare to be different and be good representatives of the Lord in their various institutions and nation at large.<\/p><p>10. Father, let Kingdom Life Assembly 26th - 31st August be successful and that the assembly be Spirit-filled, souls enriched and yokes shall be broken during the 6-days power packed events.<\/p>"},{"id":8,"title":"august prayer showers","message":"<p>PRAYER FOR THE CHURCH<\/p><p>1. Ask the Lord to purge His Church in Nigeria from all unrighteousness, corruption and various defilement pervading God's altar. 1 Peter 4:17.<\/p><p>2. Pray that the glory of God will again fill the Church and that the Church in Nigeria will fulfill her mission as the salt and the light of the world. Isaiah 60:1, 2<\/p><p>3. Pray that God will deliver His Church in Nigeria from the spirit and snare of materialism and worldliness. 1 Timothy 6:10<\/p><p>4. O Lord, cause Your Church in Nigeria to begin to deploy all the resources (human, material, spiritual and financial) at her disposal for the expansion and growth of Your Kingdom here on earth. Philippians 4:15.<\/p><p>5. O Lord, raise up teaching priests and true shepherds in Your Church all over Nigeria who will diligently instruct members of the Church in sound biblical doctrine and model the lifestyle of Christ to their congregations. 2 Chronicles 15:3; Acts 13:1.<\/p><p>6. Ask the Lord to give to every member of the Church in Nigeria the courage and boldness to declare their identity and testimony as witnesses of Jesus Christ in their neighborhood, offices and market place. 1 Peter 3:15,16.<\/p><p>7. Pray that God will remove every shame preventing the Church of Christ in Nigeria from becoming effective witness of Jesus in our nation. Romans 1:16.<\/p><p>8. Pray for all our brethren in the Northern Nigeria for God's continuous protection and wisdom to comport themselves in the midst of hostility and insecurity. 1 Peter 4:15,16<\/p><p>9. Ask God to give comfort and divine restoration to all our brethren in the North who lost their loved ones, property and business to various arsons that have taken place. 2 Corinthians 1:3-4.<\/p><p>10. Ask the Lord to use the blood of the faithful and righteous ones that were slain in the various part of Northern Nigeria for the growth and expansion of His Kingdom all over the North and the entire country. Philippians 1:12-14.<\/p><p>11. Pray for all the Missionaries, Pastors and other Church Workers in the entire Northern Nigeria for protection, security and deliverance from the wicked ones. 2 Timothy 4:18<\/p><p>12. Pray for the entire Christian Body in Nigeria to remain united, courageous and resilient in our commitment to the Lord and His work. Acts 4:29-30.<\/p><p>13. Ask the Lord to expose and destroy every antics of the enemy to divide the Church of Christ in Nigeria. Job 5:12-14.<\/p><p>14. Pray for the Christian Association of Nigeria (CAN) led by our Convention President, Rev. Dr Samson Ayokunle and all other officers at the national, regional and state levels that they we will all be united and speak with one voice. Acts 2:1-4.<\/p><p>15. Pray that the Lord of Host will arise and intersect all the forces that areaggressively advancing against His Church in Nigeria and other parts of the world. Psalm 2:1-5.<\/p><p>16. Pray that God will arm His Church in Nigeria with divine strategy to grow and expand His Kingdom all over the federation particularly in Northern Nigeria. Acts 4:29-30.<\/p><p>17. O God, begin now to move against all the false prophets that are desecrating Your name, Your sanctuary and violating Your Church which You redeemed and saved by Your blood. 1John 2:18,19<\/p><p>18. Lord, revive your Church in Nigeria and let her rediscover Your ultimate mandate for the Church which is raising faithful disciples and true worshippers that are well equipped to take the battle to the gates of the enemy. Matthew 28:19-20.<\/p><p>19. Lord, have mercy and restore all the Christian Leaders in Nigeria who by their lifestyles and teachings have departed from the true gospel and have started preaching another gospel leading their followers into spiritual errors and eternal damnation. 2 Timothy 3:6.<\/p><p>20. Pray that the Lord will use the current happenings in Nigeria for the awakening of His Church and restoration to our first love. Romans 8:28<\/p><p>21. Pray against the spirit of lukewarmness, greed and materialism that has crippled the Church. 1 Timothy 6:10; 2 Timothy 3:1,2<\/p><p>22. Ask the Lord to unite the Church in Nigeria and fortify us with the knowledge of His will, grace and courage to withstand every aggression against the Church without compromising the message of the cross. John 17:20-21.<\/p><p>LAGOS WEST CONFERENCE<\/p><p>1. Thank the Lord of mercy, for the growth and development the Conference has witnessed since inception; pray that more growth will be experienced in the coming years.<\/p><p>2. Pray that the Lord will go with the Conference this year as they conquer new mountains and new territories. Joshua 14:12.<\/p><p>3. Lord, empower the Conference to engage more in missions; equip her to make unusual exploits in capacity building. Matthew 28:18-20.<\/p><p>4. Ask that the Almighty God will cause spiritual awakening to happen in the Conference; pray that all churches will experience explosive revival, in Jesus' name. Acts 2:41.<\/p><p>5. Eternal God, grant the Conference uncommon success in the secretariat project she has embarked on; lead her to finish it as you have ordained. 1Kings 9:1-3.<\/p><p>6. God of grace, cause children in the Conference to grow up healthy and strong; fill them with Your wisdom, knowledge, and understanding; guard and guide them to fulfill their purpose in life. Luke 2:40.<\/p><p>7. Everlasting Father, constrain youths in the Conference to make right choices in life; direct their zeal and interest toward Your cause; show them the way when they are confused; give them breakthrough in all their ventures; and keep them on top of all circumstances of life. Proverbs 3:5-10.<\/p><p>8. Faithful God, give departmental heads in the Conference success in their leadership roles; give them vision and direction; teach them how to lead Your people; and let the Holy Spirit take over their lives absolutely. Genesis 24:12.<\/p><p>9. Lord, baptise all pastors and deacons in the Conference with the Holy Spirit. Anoint them with power and fire; cause them to win and nurture souls; and through them, confirm the gospel with signs and wonders. Mark 16:15-18.<\/p><p>10. Gracious Father, endow paid and voluntary workers with deep insight, wisdom,and skills; let their services lead to rapid growth and advancement in the Conference; and protect them from the evil one, in Jesus' name. John 17:11-13.<\/p><p>11. Lord of mercy, cause members of the Conference to be obedient to your instructions, faithful in their giving, zealous in their service, godly in their relationship and persistent as they await the rapture, in Jesus' name. 1 Samuel 15:22-23.<\/p><p>NIGER-KEBBI CONFERENCE<\/p><p>1. Pray in accordance with Psalm 19: 2, that every day of the month in year shall speak goodness into the lives of members in the Conference in Jesus' Name.<\/p><p>2. Pray that every weapon fashioned against families in the Conference will not prosper in Jesus' Name. Isaiah 54: 17.<\/p><p>3. Pray and command evil to depart from churches, organs and life of members in the Conference in Jesus' name.<\/p><p>4. Ask that the Spirit of power will come on Associations, churches, pastors, leaders and members of the Conference so they can fulfil the purpose of God. Acts 1:8.<\/p><p>5. Pray that the Conference and her organs will not be overcomed by darkness in Jesus' Name but she will radiate the light of God in her environment. John 1:5<\/p><p>6. Pray that the Lord will order the steps of the Conference president, executive committee members, pastors and deacons as they lead various organs in the Conference. Psalm 23:6<\/p><p>7. Pray that all doors of failure will lift up their heads in Jesus mighty name. Psalm 24:7<\/p><p>8. Decree in the mighty name of Jesus that evil storms programmed for the Conference shall be silenced in Jesus' name. Matthew 8:26.<\/p><p>9. Pray that God will provide for the Conference to actualise the various projects she has embarked on at different levels.<\/p><p>10. Pray for all Associations and churches in the Conference to continue to grow from grace to grace.<\/p>"},{"id":9,"title":"september prayer showers","message":"<p>PRAYERS ON EDUCATIONAL PURSUIT<\/p><p>1. Father, cause me to experience unprecedented success in my educational pursuits. Psalm1:3<\/p><p>2. In the name of Jesus Christ, I bind every spirit of mediocrity in my educational pursuit. Psalm 72:11.<\/p><p>3. I use the authority in name of Jesus to declare open, doors that are closed against my educational pursuit. Isaiah 22:22.<\/p><p>4. Your word in Psalm 23: 1 says the Lord is my shepherd I shall not want, therefore, Lord send heavenly provision to pursue my education.<\/p><p>5. Lord, I bind the spirit of discouragement that is working against my educational pursuit. Proverbs 13:12.<\/p><p>6. God, I ask for Your abiding presence and power in my educational pursuit. Genesis 39:23.<\/p><p>7. I ask for the favour of God and men as regards my educational pursuit. Luke. 2:52.<\/p><p>8. I pray through the help of the Holy Spirit, I will achieve an incredible mark in my educational pursuit. Daniel 6:3.<\/p><p>9. I use my authority in Christ Jesus to silence every power that says no to excellence in my educational pursuit. Psalm 45:7.<\/p><p>10. My Father, arise and scatter the enemy within and without rising against my success in my educational pursuit. Psalm 35:1.<\/p><p>11. I declare that every Goliath against my educational pursuit shall fall. 1 Samuel 17:48, 49.<\/p><p>12. Lord, I receive sound health and mind throughout my educational pursuit. Nehemiah 8:10.<\/p><p>13. Lord, break the backbone of the stubborn pursuer of my goal in life. Ephesians 6:10<\/p><p>14. In the mighty name of Jesus, I command total destruction of all satanic technology against my educational pursuit. Isaiah 54:17.<\/p><p>15. Father, on the day of my glory, nobody will replace me; my honour will not be given to another person. Luke 10:17.<\/p><p>16. I stand on His word, and I declare paralysed every spirit of fear that wants to incapacitate my educational pursuit. 2 Timothy 1: 7.<\/p><p>17. Holy Spirit, remove my name from the book of backwardness, and I receive advancement in the mighty name of Jesus. 1 Corinthians 5:17.<\/p><p>18. I command arrow of affliction targeted against my educational pursuit to backfire in Jesus' name. Psalm 91: 5.<\/p><p>19. I release Holy Ghost fire against every spiritual roadblock to my educational pursuit in the mighty name of Jesus. Revelation 12: 11<\/p><p>20. In the name of Jesus, I will not undergo hardship in pursuing my education. Isaiah 61:7<\/p><p>OGBOMOSO CONFERENCE<\/p><p>1. Thank the Lord for His grace upon the Conference, for her past and present leaders, for church growth, Osun Conference that came out of them, for churches and their pastors, for the various organs: WMU, MMU, YOUTH, BSF, etc. Thank God for her mission work in Kamuku that has grown to become an Association in Niger\/Kebbi Conference.<\/p><p>2. Pray that the Lord will revive His work in the Conference as well as Ogbomoso land and districts. Grant the pastors fresh anointing for service, uphold them and their families and create in them a burning desire to do Your will.<\/p><p>3. Lord let there be peace in every home and church in the Conference. Pray that pastors will work peacefully together in multi-staff ministry; that pastors and deacons relationships be cordial; and couples live happily with their spouses.<\/p><p>4. Lord help the Conference to start and finish 40th Anniversary project, which is the administrative office complex.<\/p><p>5. Pray for grace and provision to complete the BSF LAUTECH CHAPEL this year.<\/p><p>6. Oremerin Baptist House is a project that has been on for about 30 years. It is nearing completion. Lord, bless the Conference abundantly to finish the project by December 2018.<\/p><p>7. Lord choose for the Conference a new president after Your own heart who will lead the Conference to do Your will and accomplish Your purpose. Lord abide with Rev. Dr Israel Olaniyan and his family as they rotate out to another area of ministry.<\/p><p>8. Commit the mission board, missionaries and pastors in Kamuku Home Mission field into God's hands; pray that He will protect them, bless their mission efforts, bless their homes and make them fruitful.<\/p><p>9. Pray for all her missionary organizations and departments: WMU, MMU, YOUTH, BSF, CED, DLS, and SOCIAL etc. Pray that they will be active, fulfil their mandates, guide and guard their leader to lead right.<\/p><p>10. Ask that the Lord will forgive the Conference and churches in areas where they are failing. Pray for grace to overcome this weakness. Help pastors to take discipleship more seriously than ever; arouse members to submit themselves for discipleship training.<\/p><p>OGUN BAPTIST CONFERENCE<\/p><p>1. Pray for the Conference President, Rev. Dr Segun Jayesimi and his familythat he will finish well and strong.<\/p><p>2. Pray that the new Conference President will begin and finish well in Jesus' name.<\/p><p>3. Ask the Lord to make every member of the Conference faithful stewards of the Lord.<\/p><p>4. Pray that the needs for Mission and Evangelism of the Conference will be met in Jesus' name.<\/p><p>5. Pray for Churches in Conference to experience balanced growth and remain relevant in the scheme of God for this generation.<\/p><p>6. Pray that Rev. Emmanuel Osinubi Memorial Baptist Nursery &amp; Primary School, Patterson Memorial Baptist Grammar School, Abeokuta and other Baptist Schools in the state will experience progress in academic endeavours and in spiritual matters.<\/p><p>7. Pray that God will give enabling grace to officers of the Conference to provide effective leadership that will move the Conference forward in Jesus' name.<\/p><p>8. Pray that all departments will discharge their duties with fear of the Lord for the furtherance of the Gospel in the Conference and world at large.<\/p><p>9. Pray that the light of the gospel will continue to reign in the Conference and among the leadership as Conference coordinates the activities of state chapel.<\/p><p>10. Pray that the Radio Evangelism of the Conference entitled ‘The Light’ will continue to bring souls to the Kingdom and blessings to the sponsors.<\/p>"},{"id":10,"title":"october prayer showers","message":"<p>NIGERIA AS A COUNTRY<\/p><p>1. O Lord, let Your Kingdom which is characterized by righteousness, peace and joy be established over the Federal Republic of Nigeria beginning from the seat of power in Aso Rock, Abuja. Matthew 6:10; Romans 14:17<\/p><p>2. Ask the Lord by His mighty power to overthrow and uproot every ruler, power and dominion competing with His lordship over Nigeria. Matthew 3:10<\/p><p>3. Pray that Nigeria will fully experience and enjoy true independence from every power that has held her captive. Isaiah 49:24-26.<\/p><p>4. Arise O Lord over Nigeria; restore all her lost glory and destroy every evil agenda from the pit of hell planned to hinder Your purpose for her from coming to pass. Isaiah 44:24-26.<\/p><p>5. Ask the Lord to break every snare of wickedness, injustice, unrighteousness and corruption in Nigeria. Psalm 124:7.<\/p><p>6. Ask the Lord to put an end to violence and all kinds of insurgence, killings and destruction in Nigeria. Isaiah 60:18.<\/p><p>7. Proclaim God's peace all over the 36 states and Abuja. Pray that the Lord will expose and destroy all weapons of warfare in Nigeria. Psalm 46:9.<\/p><p>8. Decree a season of absolute peace, harmony and tranquility within the border of the Federal Republic of Nigeria. Psalm 127:7.<\/p><p>9. O Lord, begin now to expose all those who are behind various violence and unrest in the Nigeria, and let there be an end to violence in the country. Psalm 125:3.<\/p><p>10. Command the life of God to manifest in every sector and institution in Nigeria. Command every sector and institution to begin to work as the Lord causes His Spirit to brood over them. Ezekiel 37:9, 10.<\/p><p>11. Decree over Nigeria that every wall and pillar of the bond woman will not stand but collapse after the order of the wall of Jericho in Jesus' name. Joshua 6:20.<\/p><p>12. Pray for God's visitation in Nigeria that will result in divine cleansing, restoration of the lost glory, healing for the land and the rise of godly leadership. Revelation 21:4,5.<\/p><p>13. Decree that every agenda from the pit of hell against Nigeria will not stand. Isaiah 54:17.<\/p><p>14. Pray that the fear of God will fill the hearts of every citizen, our political leaders and traditional rulers for justice, peace and righteousness to reign in our land. Exodus 1:17.<\/p><p>15. Ask the Lord to arise over Nigeria for her deliverance and freedom from all that have held her in<\/p><p>captivity and have plundered her. Pray that God will send a deliverer to rescue us. Exodus 3:9, 10.<\/p><p>16. Pray for God's visitation and revival in all the Christian Fellowships that are on various campuses of our educational institutions in Nigeria.<\/p><p>17. Pray that the Lord will restore sanity, discipline and righteousness into all our educational institutions in Nigeria. Habakkuk 3:2<\/p><p>18. Ask the Lord Almighty to pull down the strongholds of impunity, corruption, injustice and unrighteousness in our Legislature and the Judiciary both at the national, state and local governments in Nigeria. Amos 5:24.<\/p><p>19. Pray specifically for restoration of peace and security in the North-East Geo- Political Zone that has become spiritual battleground with increased hostility and violence against Christians. Isaiah 60:18<\/p><p>20. Pray that the gate of hell and Islamic stronghold trying to take over the North- East Geo-Political Zone will collapse and Jesus will continue to reign all over the states there.<\/p><p>OKE OGUN CONFERENCE<\/p><p>1. Pray that there will be great awakening and salvation of souls in Oke Ogun Area.<\/p><p>2. Pray that the Holy Spirit will release greater unction to function to the pastors and<\/p><p>church workers in the Conference.<\/p><p>3. Pray that God will rekindle the zeal of churches (pastors and members) to be faithful to our cooperative works at all levels.<\/p><p>4. Pray that God will give new and needed vision to the pastors in the Conference to enlarge the kingdom of God.<\/p><p>5. Pray that God will grant everyone in the Conference the spirit of obedience to His Word.<\/p><p>6. Pray that God will save the unsaved in the churches and in Oke Ogun area as a whole.<\/p><p>7. Pray that the Holy Spirit will equip every member in the Conference with power and<\/p><p>authority to overcome the forces of darkness.<\/p><p>8. Pray that the fire of the Holy Ghost will fall afresh on the youths and elders to do exploit for His kingdom.<\/p><p>9. Pray that God will release His financial blessing on the members, churches and Conference for kingdom financing.<\/p><p>10. Pray that the leadership of the Conference, Associations and Churches will be good examples to the flock of God.<\/p><p>ONDO CONFERENCE<\/p><p>1. Pray and declare that Ondo Conference will shine forth and continue to declare the glory of God – Isaiah 60:1.<\/p><p>2. Pray that God will supply and raise support for the Ondo State Baptist Millennium City Project in Jesus' name. 1 Chronicle 29:6-18; 22:2.<\/p><p>3. Pray that the Baptist Millennium City Project will not stop nor suffer opposition from any quarter in Jesus' name. Zechariah 4:8-10.<\/p><p>4. Ask God to give members of the Conference the spirit and heart of dedication and commitment to give to the work of God. Acts 4:33-35.<\/p><p>5. O Lord, let your power prevail over all the power of darkness in Ondo Conference in Jesus' name. Job 5:12-14.<\/p><p>6. Rebuke every spirit of Sambalath and Tobiah at work in the Conference in Jesus' name. Nehemiah 2:19-20.<\/p><p>7. Father, give all the pastors in the Conference insight to see the need to disciple their members and prepare them for rapture. Acts 18:24-25.<\/p><p>8. Every horn that has been assigned to scatter mission effort and God-given investment in the Conference, be consumed by fire in Jesus' name.<\/p><p>9. Members of the Conference will not experience spiritual and physical accident in Jesus' name. Zechariah 1:18-21<\/p><p>10. Lord of host, raise godly men and women for the expansion of the work of God in Ondo Conference. 2 Kings 6:1-4<\/p><p>11. By God's divine power, doors of opportunities are opened the Conference.&nbsp; Corinthians 16:9.<\/p>"},{"id":11,"title":"november prayer showers","message":"<p>RETIRED PASTORS\/MINISTERS<\/p><p>1. Pray that all our retired pastors\/ministers shall continue to age gracefully and that the Lord will continue to renew their strength. Deuteronomy 34:7<\/p><p>2. Pray that all our retired pastors\/ministers shall continue to see and hear God speak as He wants them to remain relevant and useful in the scheme of His purpose. John 5: 17-20.<\/p><p>3. O Lord, grant unto all our retired pastors\/ministers divine grace to raise up the younger ministers\/pastors to be men\/women of God with integrity and be faithful ministers. 2 Timothy 2:1-2<\/p><p>4. O Lord, pour Your Spirit afresh upon all our retired ministers\/pastors that they may continue to dream dreams that will be helpful to our Convention and the Body of Christ at large. Joel 2:28b<\/p><p>5. Pray that the Lord shall continue to supply all the needs of our retired pastors\/ministers and family so that they may not lack anything good throughout their lifetime. Psalm 23:1; Philippians 4:19<\/p><p>6. Ask the Lord to keep all our retired pastors\/ministers fresh, healthy and fruitful, as they remain rooted in the grace of the Lord Jesus. Psalm 92:14.<\/p><p>7. Plead with the Lord on behalf of our retired ministers that they will not lose sight of their final resting place among the cloud of witnesses. Genesis 15: 15<\/p><p>8. Pray that our retired pastors\/ministers will continue to abide in Christ, the true Vine so that they may enjoy fresh relationship with Lord in life and ministry even at old age. Psalm 71: 9.<\/p><p>9. Ask that the hand of the Lord God of glory will remain upon all our retired pastors\/ministers that they may continue to raise godly children for the Lord even in their even at old age. Genesis 21: 7.<\/p><p>10. Pray that what our retired pastors\/ministers have built in life and ministry will not crumble before their eyes. Genesis 37: 35.<\/p><p>11. Ask the Lord for His visitation and accomplishment of all the outstanding promises to all our retired pastors\/ministers and their families as He did to Abraham and Sarah in their old age. Genesis 22: 1ff.<\/p><p>12. O Lord, grant all our retired pastors\/ministers long life and cause them to see the fruit of their labour over their family and Your Church. Isaiah 53:11.<\/p><p>13. Pray that all our retired pastors\/ministers shall not grow weary in faith but remain steadfast till they finally lay down their sword at the feet of the Lord and return to Him in glory. 2 Timothy 4:7.<\/p><p>14. O Lord, remember our retired pastors\/ministers with favour for all their service in your vineyard and do not blot out what they faithfully did for Your Church and her services. Nehemiah 13:14.<\/p><p>15. O Lord, bless and preserve all the biological\/spiritual children and grand children of our retired pastors\/ministers and let them not depart from the godly heritage they have been taught from childhood. Jeremiah 35:18-19.<\/p><p>16. Pray that our retired pastors\/ministers will not lose their physical and spiritual sight like Eli till they depart to be with the Lord in glory. 1 Samuel 3:2<\/p><p>17. O Lord, keep our retired pastors\/ministers and help them not to secretly return to any of the evil practices they have once denounced like King Saul. 1 Samuel 28:7-13<\/p><p>18. O Lord, grant all our retired pastors\/ministers the grace to finish strong. 1 Chronicles 29: 28<\/p><p>19. O Lord, grant all our retired pastors\/ministers and family a safe landing both in life and ministry. Ruth 4: 15.<\/p><p>20. Ask that the gracious hand of the living God will bear our retired pastors\/ministers and lead them in the part of eternal life. Isaiah 46: 4.<\/p><p>OSUN CONFERENCE<\/p><p>1. Bless the name of the LORD for the grace received by the Conference to strive on for Him.Declare that the Conference will not be discouraged.<\/p><p>2. Ask that God will raise men who will be fully involved in pursuing the vision of the expansion of God's kingdom in the conference and beyond.<\/p><p>3. Commit all the pastors, deacons and their spouses in the Conference unto God's care, that God will uphold them and give them more unction to function; they will daily enjoy peace and total support of their spouses for ministerial success and exploits.<\/p><p>4. Ask that God will give the spirit of power, love and sound mind to all executive council members to courageously work together to conquer the challenges of the conference (e.g. taking back our schools from the government).<\/p><p>5. Pray that the sources of income of the Conference will increase and yield great results to cater for projects as planned and even to do more.<\/p><p>6. Pray for faithfulness and more anointing on all pastors and departmental leaders to focus on their families and ministries.<\/p><p>7. Pray that every new officer will achieve more than their predecessors did in the Conference.<\/p><p>8. Pray that every missionary arm of the conference will truly and boldly work for missions and evangelism. Their leaders will be focused and committed to kingdom business.<\/p><p>9. Ask that every member of the conference will shun negative influences and be committed to making the conference greater than how she was in past years.<\/p><p>10. Pray that God will overthrow powers and principalities contending against His work in Osun Conference. Ask that the land will be restored from every cultic practice.<\/p><p>PROVIDENCE-DELTA CONFERENCE<\/p><p>1. Ask that the Lord will give strength, wisdom and grace upon the leadership of Providence-Delta Conference.<\/p><p>2. Father, let Your kingdom and Your righteousness be established and made manifest in the Conference.<\/p><p>3. Pray for sanctification and harmony among staff and executive committed members of Conference. Pray for divine speed in all their endeavours.<\/p><p>4. Pray that the Lord will release His unquenchable fire, His glorious cover upon the pastors, local churches, associations and conference and cause them to flourish in their ministries.<\/p><p>5. Father, let the sinful nature be put to death in the lives of conference’s children, youths and adults; that they will look unto Jesus only for their salvation, security, success and satisfaction.<\/p><p>6. Lord, open the floodgates of heaven over the Providence-Delta Conference; raise people that will be financial pillars to build Your kingdom.<\/p><p>7. Lord, help your church in Providence-Delta Conference not to miss Your purpose but to continue in the ministry of true worship and the winning of souls for Your kingdom.<\/p><p>8. Pray for renewal of life and total commitment to the work of God among the various fellowships and organizations of the Conference; MMU, WMU, Youth, Pastors, Deacons, Teachers, Pastors Wives, BSF, RA, Lydia, GA and Sunbeam.<\/p><p>9. Pray for inspiration and submissive spirits for members of the Conference to live, lead a purposeful life, and remain under Your agenda.<\/p><p>10. Lord, visit every life, home, office, career, business and destiny in Providence-Delta Conference; manifest Yourself, grant Your miracles and multiplications, and lead Your people in victory procession, in Jesus' name.<\/p>"},{"id":12,"title":"december prayer showers","message":"<p>RESTORATION AND RECOVERY<\/p><p>1. Thank God for allowing you and your family to see the last month of the year 2018.<\/p><p>2. Pray that the Lord will fight every necessary battle for your restoration to fortune and greatness. Psalm 80:19; 126: 4.<\/p><p>3. O Lord my God, restore me to Yourself and fulfil Your plans for my life.Lamentation 5: 21<\/p><p>4. God of restoration restore unto me in double fold the months that the cankerworm has eaten Zechariah 9: 12.<\/p><p>5. All the good things of life that I lost in the year, may the Lord restore them to me. 1Samuel 7: 14.<\/p><p>6. I decree the restoration of peace and prosperity to Nigeria.<\/p><p>7. Every power holding me back from restoration lose your authority over my life now.<\/p><p>8. Holy Spirit, let there be a restoration of hope and fulfilment in my life and family.<\/p><p>9. And after you have suffered a little while, the God of all grace, who has called you to his eternal glory in Christ, will himself restore, confirm, strengthen, and establish you. O Lord Arise in my favour and restore me to a greater glory. 1 Peter 5: 10.<\/p><p>10. I overtake and recover all my stolen blessings and fortune. 1 Samuel 30: 8.<\/p><p>11. I recover every buried dream, vision and grace in my life in Jesus' name.<\/p><p>12. Lord, I receive the gift of health for my life and everyone within my family in Jesus' name Jeremiah 30:17.<\/p><p>13. Lord Jesus, restore right leaders over our nation according to Your Word. Isaiah 1: 26.<\/p><p>14. Lord, let my season of captivity be over, restore me into my place of flourishing. Jeremiah 27: 22.<\/p><p>15. Lord restore to me in your grace the wasted months in 2018. Joel 2: 25.<\/p><p>16. All the benefits I have been denied in the year 2018, Lord command their release today. Luke 19: 8.<\/p><p>17. Holy Spirit, restore back to the faith all believers who have gone astray likesheep without shepherds. Galatians 6: 1.<\/p><p>18. Lord raise up for the Church, men and women after Your own heart as arrowhead for the next spiritual awakening. Isaiah 58: 12.<\/p><p>19. Lord let your hand of grace be visible on my children and make them restorers of life and sustainers of my old age. Ruth 4: 15.<\/p><p>20. O Lord I receive full restoration for the year 2018, before entering the new year.<\/p><p>RIVERS CONFERENCE<\/p><p>1. Thank God for the Conference President, Rev. B. G. Avor and his family. Pray that God will keep them safe in His hands.<\/p><p>2. Ask God to direct the deliberations of the Conference Executive Committee in her quarterly meetings<\/p><p>3. Pray for revival of rural churches currently experiencing retarded growth.<\/p><p>4. Resist every demonic spirit promoting idolatry &amp; ritualism in both rural and urban areas.<\/p><p>5. Pray that members will go back to Bible standards in their spirituality.<\/p><p>6. Pray for the end of cultism among the youths and adults in the state.<\/p><p>7. Pray for the inauguration of Monarch's fellowship in the Conference.<\/p><p>8. Pray for unity among members in the Conference in spite of their political differences<\/p><p>9. Thank God for the successful hosting of the 2018 Convention-in-Session. Pray that the Lord will prosper His people.<\/p><p>10. Pray that mission organisations in the Conference will be united in carrying out the Great Commission.<\/p><p>SOUTHERN KADUNA CONFERENCE<\/p><p>1. Thank God that Southern Kaduna has not been completely destroyed by Islamic Jihadists; pray that God will continue to disappoint their plans.<\/p><p>2. Pray for sustainable peace in Southern Kaduna.<\/p><p>3. Pray that the church will be united against the forces of evil.<\/p><p>4. Pray that God will provide financial resources to rebuild churches and houses destroyed in Southern Kaduna.<\/p><p>5. Pray that church planting and church growth will take firm roots in Southern Kaduna.<\/p><p>6. Pray for good governance in Kaduna State.<\/p><p>7. Pray that there shall be spiritual revival and the outpouring of the Holy Spirit in Southern Kaduna in the year 2018.<\/p><p>8. Pray that God will provide financial resources for the capital projects such as the permanent Conference Centre.<\/p><p>9. Pray for the Conference President, his family and the Conference Officers.<\/p><p>10. Pray that Churches will be faithful to the Cooperative Programme.<\/p>"}]